Tekla Open API Reference for Tekla Structures 2025
CurvedRebarGroup.Polygon Property
 A polygon definition for the curved reinforcing bar group shape. The polygon must have 3 points.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Polygon Polygon { get; set; }
Public Property Polygon As Polygon
	Get
	Set
Property Value
Type: Polygon
See Also
Reference
CurvedRebarGroup Class
Tekla.Structures.Model Namespace